In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("V5 (1).csv")
df.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,?,Detached House,3,2,1092.0,1.025953,East

In [3]:
dfc = df.copy()

In [4]:
dfc['Property'].replace('?', pd.NA, inplace=True)

In [5]:
dfc.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
0,2009-01-02,2009,Waterbury,111440.0,185000.0,Single Family,Detached House,3,3,996.0,1.025953,South
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
2,2009-01-02,2009,Waterbury,55720.0,140000.0,Single Family,Detached House,3,2,910.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
4,2009-01-02,2009,Bridgeport,112351.0,210000.0,<NA>,Detached House,3,2,1092.0,1.025953,East

In [8]:
dfc.shape

(10000, 12)

In [12]:
print(dfc.isnull().sum())

Date                    0
Year                    0
Locality             1253
Estimated Value      1243
Sale Price              0
Property             1823
Residential             0
num_rooms               0
num_bathrooms           0
carpet_area          1229
property_tax_rate       0
Face                    0
dtype: int64

In [23]:
dfc_even = dfc.iloc[0::2]
print(dfc_even.iloc[0,3])

111440.0

In [24]:
dfc_even.iloc[332, 3]

256200.0

In [25]:
dfc_odd = dfc.iloc[1::2]
dfc_odd.head()

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face
1,2009-01-02,2009,Bridgeport,124670.0,150000.0,Two Family,Duplex,4,3,1241.0,1.025953,South
3,2009-01-02,2009,Bridgeport,4775276.0,272900.0,Single Family,Detached House,3,1,971.0,1.025953,East
5,2009-01-02,2009,Greenwich,2868880.0,3300000.0,Single Family,Detached House,3,1,1039.0,1.025953,North
7,2009-01-02,2009,Greenwich,592760.0,920000.0,Single Family,Detached House,3,3,937.0,1.025953,North
9,2009-01-02,2009,Bridgeport,137901.0,245000.0,Single Family,Detached House,3,1,956.0,1.025953,West

In [26]:
dfc_odd.iloc[332, 3]

352940.0

In [27]:
dfc_column_odd = dfc.iloc[:, 1::2]
dfc_column_odd.head()

   Year  Estimated Value       Property  num_rooms  carpet_area   Face
0  2009         111440.0  Single Family          3        996.0  South
1  2009         124670.0     Two Family          4       1241.0  South
2  2009          55720.0  Single Family          3        910.0  South
3  2009        4775276.0  Single Family          3        971.0   East
4  2009         112351.0           <NA>          3       1092.0   East

In [28]:
dfc_column_odd.iloc[100, 5]

'West'

In [29]:
dfc_all_even = dfc.iloc[0::2, 0::2]
dfc_all_even.head()

,Date,Locality,Sale Price,Residential,num_bathrooms,property_tax_rate
0,2009-01-02,Waterbury,185000.0,Detached House,3,1.025953
2,2009-01-02,Waterbury,140000.0,Detached House,2,1.025953
4,2009-01-02,Bridgeport,210000.0,Detached House,2,1.025953
6,2009-01-02,Norwalk,1000000.0,Detached House,2,1.025953
8,2009-01-02,NaN,1680000.0,Detached House,1,1.025953

In [30]:
dfc_all_even.iloc[255,3]

'Detached House'

In [53]:
dfc["Year"] = pd.to_datetime(dfc["Date"]).dt.year
unique_years = dfc["Year"].unique()

In [54]:
unique_years[-6:]

array([2017, 2018, 2019, 2020, 2021, 2022])

In [56]:
dfc["Year"].head()

0    2009
1    2009
2    2009
3    2009
4    2009
Name: Year, dtype: int32

In [59]:
dfc.iloc[5250:5254]

,Date,Year,Locality,Estimated Value,Sale Price,Property,Residential,num_rooms,num_bathrooms,carpet_area,property_tax_rate,Face,Date_datetime
5250,2016-12-31,2016,Bridgeport,227640.0,145000.0,Single Family,Detached House,3,3,1089.0,1.348259,West,2016
5251,2017-01-02,2017,Waterbury,40350.0,42000.0,Three Family,Triplex,6,6,2076.0,1.388283,West,2017
5252,2017-01-05,2017,NaN,388450.0,560000.0,Single Family,Detached House,3,3,1033.0,1.388283,North,2017
5253,2017-01-05,2017,NaN,164710.0,179900.0,Single Family,Detached House,3,1,NaN,1.388283,South,2017

In [60]:
len(dfc[dfc["Year"].isin(unique_years[-6:])])

4749

In [66]:
len(dfc[(dfc["num_rooms"] == 3) & (dfc["num_bathrooms"] == 3)])

2730

In [68]:
len(dfc[(dfc["num_rooms"] == 3) | (dfc["num_bathrooms"] == 3)])

8591

In [70]:
len(dfc[(dfc["Year"] == 2022) & (dfc["Locality"] == "Greenwich") & (dfc["num_rooms"] == 3) & ((dfc["Face"] == "North") | (dfc["Face"] == "East"))])

42

In [73]:
dfc["Month"] = pd.to_datetime(dfc["Date"]).dt.month
dfc["Month"].head()

0    1
1    1
2    1
3    1
4    1
Name: Month, dtype: int32

In [75]:
len(dfc[dfc["Month"] == 8])

1050

In [86]:
locality_avg_saleprice = dfc.groupby("Locality")["Sale Price"].mean()
locality_avg_saleprice

Locality
Bridgeport       1.740953e+05
Fairfield        7.277225e+05
Greenwich        2.270224e+06
Norwalk          5.590959e+05
Stamford         6.305313e+05
Waterbury        1.062152e+05
West Hartford    3.385472e+05
Name: Sale Price, dtype: float64

In [85]:
locality_avg_saleprice.sort_values()

Locality
Waterbury        1.062152e+05
Bridgeport       1.740953e+05
West Hartford    3.385472e+05
Norwalk          5.590959e+05
Stamford         6.305313e+05
Fairfield        7.277225e+05
Greenwich        2.270224e+06
Name: Sale Price, dtype: float64